FILES/Reports/ПредопределенныеЗначенияНоменклатурБТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Report>
		<Properties>
			<Name>ПредопределенныеЗначенияНоменклатурБТ</Name>
		</Properties>
	</Report>
</MetaDataObject>

FILES/Catalogs/НоменклатураБТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>НоменклатураБТ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВМаршруте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемнаяНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСервисногоСбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаценки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКлиентаКакСуммаПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссионнаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикДляНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранитьИсторию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОтображать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбязательноеЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭмитироватьСправочник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/Reports/ПредопределенныеЗначенияНоменклатурБТ/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	ОчиститьСообщения();
	СформироватьОтчет();
	Результат.ОтображатьСетку = Истина;
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	
	//Если НЕ ПроверитьЗаполнение() Тогда
	//	Возврат;
	//КонецЕсли;
		
	УстановитьПривилегированныйРежим(Истина);
	
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	Результат.Очистить();
	
	Область = Макет.ПолучитьОбласть("Шапка|Основное");
	Результат.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Детали|Основное"); 
	ОбластьХ = Макет.ПолучитьОбласть("Детали|Характеристика");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(250)) КАК УникальныйИдентификатор,
	               |	НоменклатураБТ.Ссылка КАК Ссылка,
	               |	НоменклатураБТ.Наименование КАК Наименование,
	               |	НоменклатураБТ.Номенклатура КАК Номенклатура,
	               |	НоменклатураБТ.ИспользуетсяВМаршруте КАК ИспользуетсяВМаршруте,
	               |	НоменклатураБТ.СистемнаяНоменклатура КАК СистемнаяНоменклатура,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(250)) КАК Характеристика,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(250)) КАК Значение,
	               |	НоменклатураБТХарактеристики.Характеристика КАК ХарактеристикаСсылка,
	               |	НоменклатураБТХарактеристики.Характеристика.Наименование КАК ХарактеристикаНаименование,
	               |	НоменклатураБТХарактеристики.ХранитьИсторию КАК ХранитьИсторию,
	               |	НоменклатураБТХарактеристики.НеОтображать КАК НеОтображать,
	               |	НоменклатураБТХарактеристики.ОбязательноеЗаполнение КАК ОбязательноеЗаполнение,
	               |	НоменклатураБТХарактеристики.ЭмитироватьСправочник КАК ЭмитироватьСправочник
	               |ИЗ
	               |	Справочник.НоменклатураБТ КАК НоменклатураБТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураБТ.Характеристики КАК НоменклатураБТХарактеристики
	               |		ПО (НоменклатураБТХарактеристики.Ссылка = НоменклатураБТ.Ссылка)
	               |ГДЕ
	               |	НЕ НоменклатураБТ.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование,
	               |	Характеристика
	               |ИТОГИ ПО
	               |	Ссылка
	               |АВТОУПОРЯДОЧИВАНИЕ";
	//Таблица = Запрос.Выполнить().Выгрузить();
	ВыборкаШапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Для Каждого ТекСтрока Из Таблица Цикл  
	Пока ВыборкаШапка.Следующий() Цикл
		//ВыборкаШапка.УникальныйИдентификатор = XMLСтрока(ВыборкаШапка.Ссылка);
		//вывод по строкам
		ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаШапка.Ссылка);
		Область.Параметры.УникальныйИдентификатор =  XMLСтрока(ВыборкаШапка.Ссылка);
		Результат.Вывести(Область);
		
		ВыборкаДетали = ВыборкаШапка.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл  
			//вывод по колонкам
			МассивJson = Новый Массив;
			Структура = Новый Структура("Характеристика, ХранитьИсторию, НеОтображать, ОбязательноеЗаполнение, ЭмитироватьСправочник", 
				ВыборкаДетали.ХарактеристикаНаименование, 
				ВыборкаДетали.ХранитьИсторию, 
				ВыборкаДетали.НеОтображать, 
				ВыборкаДетали.ОбязательноеЗаполнение, 
				ВыборкаДетали.ЭмитироватьСправочник);
			МассивJson.Добавить(Структура);
			Попытка
				ОбластьХ.Параметры.Характеристика = СтрЗаменить(СтрЗаменить(УправлениеБТВызовСервера.ВJSON(МассивJson),"[",""),"]","");
				Результат.Присоединить(ОбластьХ);
			Исключение
			КонецПопытки;
			//Попытка
			//	ВыборкаДетали.Характеристика = СтрЗаменить(СтрЗаменить(УправлениеБТВызовСервера.ВJSON(МассивJson),"[",""),"]","");
			//	ВыборкаДетали.Значение = СтрЗаменить(СтрЗаменить(УправлениеБТВызовСервера.ВJSON(МассивJson),"[",""),"]","");
			//Исключение
			//	ВыборкаДетали.Характеристика = "";
			//	ВыборкаДетали.Значение = "";
			//КонецПопытки;
		КонецЦикла;
		
	КонецЦикла;
	
	Элементы.Результат.ОтображениеСостояния.Видимость = ложь; 
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
		
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Элементы.Результат.ОтображениеСостояния.Видимость = ложь; 
	//Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
КонецПроцедуры
